In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
        {"a":[4,5,6,6,np.nan],
        "b":[7,8,np.nan,9,9],
        "c":[10,11,12,np.nan,12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [5]:
df[df.a<7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [6]:
df[df.b>7]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [7]:
df.b>7

n  v
d  1    False
   2     True
e  2    False
   3     True
   4     True
Name: b, dtype: bool

In [8]:
df[df['c']>7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [9]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [10]:
df.drop_duplicates?

Signature: df.drop_duplicates(subset=None, keep='first', inplace=False)
Docstring:
Return DataFrame with duplicate rows removed, optionally only
considering certain columns. Indexes, including time indexes
are ignored.

Parameters
----------
subset : column label or sequence of labels, optional
    Only consider certain columns for identifying duplicates, by
    default use all of the columns
keep : {'first', 'last', False}, default 'first'
    - ``first`` : Drop duplicates except for the first occurrence.
    - ``last`` : Drop duplicates except for the last occurrence.
    - False : Drop all duplicates.
inplace : boolean, default False
    Whether to drop duplicates in place or to return a copy

Returns
-------
DataFrame
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [13]:
# 중복된 값 삭제
df = df.drop_duplicates(keep='last')
df
# keep='first' 또는 keep='last' 옵션을 사용하면
# 중복된 행 삭제시 남아있을 행 선택하는데에 쓰인다.

'''
keep : {'first', 'last', False}, default 'first'
    - ``first`` : Drop duplicates except for the first occurrence.
    - ``last`` : Drop duplicates except for the last occurrence.
    - False : Drop all duplicates.
'''

"\nkeep : {'first', 'last', False}, default 'first'\n    - ``first`` : Drop duplicates except for the first occurrence.\n    - ``last`` : Drop duplicates except for the last occurrence.\n    - False : Drop all duplicates.\n"

In [13]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [14]:
df[df["b"]!=7]
# b의 값들 중 7이 아닌 값만 추출

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [15]:
# 특정값 존재확인
# isin에는 값을 리스트 형태로 지정해야한다.
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
   4    False
Name: a, dtype: bool

In [16]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
   4    False
Name: a, dtype: bool

In [17]:
# 결측값 존재확인
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [18]:
df['a'].isnull().sum()

1

In [19]:
# 결측값이 아닌 값 존재확인
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [20]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [21]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

* ### &,|,~,^,df.any(),df.all()
* ### and, or, not, xor, any, all

In [22]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [23]:
df[df.b==7] & df[df.a==5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

In [24]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

* ### 무작위 샘플 추출시, sample 메서드를 사용한다.

In [25]:
df.sample(frac=0.5)
# 전체 개수의 비율 만큼 샘플을 반환하려 할 경우 사용된다.
# 0.5 이면 50% 즉, 데이터의 반 만큼 반환
# 1 이면 모두 가져온다.

       a    b     c
n v
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [26]:
df.sample(n=2)
# n 개 만큼 랜덤으로 추출한다.

       a    b     c
n v
e 4  NaN  9.0  12.0
  3  6.0  9.0   NaN

In [27]:
df.iloc[1:2]
# 지정위치에 해당하는 행 값을 불러온다.

       a    b     c
n v
d 2  5.0  8.0  11.0

In [14]:
df=pd.DataFrame({'a':[1,10,8,11,-1],
                 'b':list('abdce'),
                 'c':[1.0,2.0,np.nan,3.0,4.0]})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

In [15]:
df.nlargest(3, 'a')
# 지정된 값에서 큰 순서대로 n의 개수만큼 불러온다.(결측값 제외)

    a  b    c
3  11  c  3.0
1  10  b  2.0
2   8  d  NaN

In [16]:
df.nsmallest(2, 'c')
# 지정된 값에서 작은 순서대로 n의 개수만큼 불러온다.(결츨값 제외)

    a  b    c
0   1  a  1.0
1  10  b  2.0